_author__ = 'Барабанов Павел Александрович'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

number = int(input('Enter a number: '))

while number > 0:
    print(number % 10)
    number = number // 10

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!

a = input('Enter a first number: ')
b = input('Enter a second number: ')
c = ''
print('a = ' + a + ', ' + 'b = ' + b)
c = a
a = b
b = c
print('a = ' + a + ', ' + 'b = ' + b)


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"

user_age = int(input('Enter your age: '))

if user_age >= 18:
    print('Login successful')
else:
    print('Failed')

