
import math
_author__ = 'Барабанов Павел Александрович'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

number = int(input('Enter a number: '))
list = []
max_number = 0

while number > 0:
    list.append(number % 10)
    number = number // 10

for i in list:
    if i > max_number:
        max_number = i

print('Max number is :', max_number)
print()

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

a = input('Enter a first number: ')
b = input('Enter a second number: ')

print('a = ' + a + ', ' + 'b = ' + b)
a, b = b, a
print('a = ' + a + ', ' + 'b = ' + b)
print()


# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4


# a = int(1)
# b = int(-2)
# c = int(-3)
a = int(input('Введите a: '))
b = int(input('Введите b: '))
c = int(input('Введите c'))
D = 0
x1 = 0
x2 = 0

# ax2 + bx + c = 0.
print('Квадратное уравнение: ' + str(a) + '(x**2) + (' + str(b) + 'x) + ' + str(c) + ' = 0')
print('a = ' + str(a) + ', b = ' + str(b) + ', c =', c)

# D = b2 − 4ac.
D = b**2 - (4*a*c)
print('D =', D)

if D < 0:
    print('Корней нет')
elif D == 0:
    x1 = (-b + math.sqrt(D)) / 2 * a
    print('x =', int(x1))
else:
    x1 = (-b + math.sqrt(D)) / 2 * a
    x2 = (-b - math.sqrt(D)) / 2 * a
    print('x1 =', int(x1))
    print('x2 =', int(x2))
